backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 923]
      dtype: int32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Embedding
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 923]
      dtype: float32
      embeddings_constraint: null
      embeddings_initializer:
        class_name: RandomUniform
        config: {maxval: 0.05, minval: -0.05, seed: null}
      embeddings_regularizer: null
      input_dim: 2000
      input_length: 923
      mask_zero: false
      name: embedding_1
      output_dim: 100
      trainable: false
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: embedding_1
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dilation_rate: !!python/tuple [1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4]
      name: conv1d_1
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - embedding_1
        - 0
        - 0
        - {}
    name: conv1d_1
  - class_name: MaxPooling1D
    config:
      name: max_pooling1d_1
      padding: valid
      pool_size: !!python/tuple [4]
      strides: !!python/tuple [4]
      trainable: true
    inbound_nodes:
    - - - conv1d_1
        - 0
        - 0
        - {}
    name: max_pooling1d_1
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dilation_rate: !!python/tuple [1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4]
      name: conv1d_2
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling1d_1
        - 0
        - 0
        - {}
    name: conv1d_2
  - class_name: MaxPooling1D
    config:
      name: max_pooling1d_2
      padding: valid
      pool_size: !!python/tuple [4]
      strides: !!python/tuple [4]
      trainable: true
    inbound_nodes:
    - - - conv1d_2
        - 0
        - 0
        - {}
    name: max_pooling1d_2
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dilation_rate: !!python/tuple [1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [4]
      name: conv1d_3
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling1d_2
        - 0
        - 0
        - {}
    name: conv1d_3
  - class_name: MaxPooling1D
    config:
      name: max_pooling1d_3
      padding: valid
      pool_size: !!python/tuple [25]
      strides: !!python/tuple [25]
      trainable: true
    inbound_nodes:
    - - - conv1d_3
        - 0
        - 0
        - {}
    name: max_pooling1d_3
  - class_name: Flatten
    config: {name: flatten_1, trainable: true}
    inbound_nodes:
    - - - max_pooling1d_3
        - 0
        - 0
        - {}
    name: flatten_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - flatten_1
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 4
      use_bias: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: dense_2
  name: model_1
  output_layers:
  - [dense_2, 0, 0]
keras_version: 2.1.4
